#!/bin/bash
cat <<"EOF"
 _           _       _           _       
| |__  _   _| | __ _| |__  _   _| | __ _ 
| '_ \| | | | |/ _` | '_ \| | | | |/ _` |
| |_) | |_| | | (_| | |_) | |_| | | (_| |
|_.__/ \__,_|_|\__,_|_.__/ \__,_|_|\__,_|
                                         
EOF
echo -e "\033[36m1. kali-linux\033[0m"
echo -e "\033[36m2. centos7\033[0m"
echo -e "\033[36m3. centos8\033[0m"
echo -e "\033[36m4. ubuntu20.04\033[0m"
echo -e "\033[31m请不要输入已有序号以外的字符，以免造成脚本或系统的异常\033[0m"
read -r -e -p "请输入你当前的系统序号按回车健继续:" name
if [[ ! "$name" =~ ^[1-4]?$ ]]; then
    exit
fi
case "${name}" in
1)
    echo -e "\033[32m脚本仅支持以下软件源\033[0m"
    echo -e "\033[36m1. 中科大源\033[0m"
    echo -e "\033[36m2. 阿里云源\033[0m"
    echo -e "\033[36m3. 清华源\033[0m"
    echo -e "\033[36m4. 浙大源\033[0m"
    echo -e "\033[36m5. 华为源\033[0m"
    echo -e "\033[31m 请不要输入已有序号以外的字符，以免造成脚本或系统的异常 \033[0m"
    read -r -p "请输入要选择的软件源按回车键继续:" num
    bash 3.sh "$num"
    ;;
2)
    echo -e "\033[32m脚本仅支持以下软件源\033[0m"
    echo -e "\033[36m1. 中科大源\033[0m"
    echo -e "\033[36m2. 阿里云源\033[0m"
    echo -e "\033[36m3. 清华源\033[0m"
    echo -e "\033[36m4. 浙大源\033[0m"
    echo -e "\033[36m5. 华为源\033[0m"
    echo -e "\033[31m 请不要输入已有序号以外的字符，以免造成脚本或系统的异常 \033[0m"
    read -r -p "请输入要选择的软件源按回车键继续:" num
    bash 4.sh "$num"
    ;;
3)
    echo "default (none of above)"
    ;;
esac
